Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ResultsURL is not in configuration)
  - resource "aws_lambda_permission" "APIGetResultsURL" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-lookup-getResultsURL" -> null
      - id                  = "AllowAPIGetResultsURLInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:496940679572:2y46pa0m1f/*/*/results" -> null
      - statement_id        = "AllowAPIGetResultsURLInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIInitLookup will be destroyed
  # (because aws_lambda_permission.APIInitLookup is not in configuration)
  - resource "aws_lambda_permission" "APIInitLookup" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-initLookup" -> null
      - id                  = "AllowAPIInitLookupInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:496940679572:2y46pa0m1f/*/*/submit" -> null
      - statement_id        = "AllowAPIInitLookupInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.LambdaDbsnp will be destroyed
  # (because aws_lambda_permission.LambdaDbsnp is not in configuration)
  - resource "aws_lambda_permission" "LambdaDbsnp" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-dbsnp" -> null
      - id                  = "PGxFlowBackendAllowDbsnpInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup" -> null
      - statement_id        = "PGxFlowBackendAllowDbsnpInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission will be created
  + resource "aws_lambda_permission" "dbsnp_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-dbsnp"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSDbsnpAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic.dbsnp will be created
  + resource "aws_sns_topic" "dbsnp" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pgxflow-backend-dbsnp"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp will be created
  + resource "aws_sns_topic_subscription" "dbsnp" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-dbsnp"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-gnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-gnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pharmcat" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-postprocessor",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-postprocessor" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-gnomad",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-preprocessor" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
              + "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-get will be destroyed
  # (because aws_api_gateway_integration.results-get is not in configuration)
  - resource "aws_api_gateway_integration" "results-get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "64j6kq" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-2y46pa0m1f-64j6kq-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "64j6kq" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-pharmcat-getResultsURL/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-options will be destroyed
  # (because aws_api_gateway_integration.results-options is not in configuration)
  - resource "aws_api_gateway_integration" "results-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "64j6kq" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-2y46pa0m1f-64j6kq-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "64j6kq" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-options will be destroyed
  # (because aws_api_gateway_integration.submit-options is not in configuration)
  - resource "aws_api_gateway_integration" "submit-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "w1ri0h" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-2y46pa0m1f-w1ri0h-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "w1ri0h" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-patch will be destroyed
  # (because aws_api_gateway_integration.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration" "submit-patch" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "w1ri0h" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "PATCH" -> null
      - id                      = "agi-2y46pa0m1f-w1ri0h-PATCH" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "w1ri0h" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-post will be destroyed
  # (because aws_api_gateway_integration.submit-post is not in configuration)
  - resource "aws_api_gateway_integration" "submit-post" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "w1ri0h" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-2y46pa0m1f-w1ri0h-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "w1ri0h" -> null
      - rest_api_id             = "2y46pa0m1f" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-get will be destroyed
  # (because aws_api_gateway_integration_response.results-get is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agir-2y46pa0m1f-64j6kq-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "64j6kq" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-options will be destroyed
  # (because aws_api_gateway_integration_response.results-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-2y46pa0m1f-64j6kq-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "64j6kq" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-options will be destroyed
  # (because aws_api_gateway_integration_response.submit-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-2y46pa0m1f-w1ri0h-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "w1ri0h" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-patch will be destroyed
  # (because aws_api_gateway_integration_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agir-2y46pa0m1f-w1ri0h-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "w1ri0h" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-post will be destroyed
  # (because aws_api_gateway_integration_response.submit-post is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agir-2y46pa0m1f-w1ri0h-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "w1ri0h" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-get will be destroyed
  # (because aws_api_gateway_method.results-get is not in configuration)
  - resource "aws_api_gateway_method" "results-get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "yx1ubl" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-2y46pa0m1f-64j6kq-GET" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "64j6kq" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-options will be destroyed
  # (because aws_api_gateway_method.results-options is not in configuration)
  - resource "aws_api_gateway_method" "results-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-2y46pa0m1f-64j6kq-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "64j6kq" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-options will be destroyed
  # (because aws_api_gateway_method.submit-options is not in configuration)
  - resource "aws_api_gateway_method" "submit-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-2y46pa0m1f-w1ri0h-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "w1ri0h" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-patch will be destroyed
  # (because aws_api_gateway_method.submit-patch is not in configuration)
  - resource "aws_api_gateway_method" "submit-patch" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "yx1ubl" -> null
      - http_method          = "PATCH" -> null
      - id                   = "agm-2y46pa0m1f-w1ri0h-PATCH" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "w1ri0h" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-post will be destroyed
  # (because aws_api_gateway_method.submit-post is not in configuration)
  - resource "aws_api_gateway_method" "submit-post" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "yx1ubl" -> null
      - http_method          = "POST" -> null
      - id                   = "agm-2y46pa0m1f-w1ri0h-POST" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "w1ri0h" -> null
      - rest_api_id          = "2y46pa0m1f" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-get will be destroyed
  # (because aws_api_gateway_method_response.results-get is not in configuration)
  - resource "aws_api_gateway_method_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agmr-2y46pa0m1f-64j6kq-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "64j6kq" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-options will be destroyed
  # (because aws_api_gateway_method_response.results-options is not in configuration)
  - resource "aws_api_gateway_method_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-2y46pa0m1f-64j6kq-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "64j6kq" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-options will be destroyed
  # (because aws_api_gateway_method_response.submit-options is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-2y46pa0m1f-w1ri0h-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "w1ri0h" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-patch will be destroyed
  # (because aws_api_gateway_method_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agmr-2y46pa0m1f-w1ri0h-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "w1ri0h" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-post will be destroyed
  # (because aws_api_gateway_method_response.submit-post is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agmr-2y46pa0m1f-w1ri0h-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "w1ri0h" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "2y46pa0m1f" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.pipeline_pharmcat will be destroyed
  # (because aws_api_gateway_resource.pipeline_pharmcat is not in configuration)
  - resource "aws_api_gateway_resource" "pipeline_pharmcat" {
      - id          = "59yh36" -> null
      - parent_id   = "8x2vb66t09" -> null
      - path        = "/pipeline_pharmcat" -> null
      - path_part   = "pipeline_pharmcat" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "2y46pa0m1f" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.results will be destroyed
  # (because aws_api_gateway_resource.results is not in configuration)
  - resource "aws_api_gateway_resource" "results" {
      - id          = "64j6kq" -> null
      - parent_id   = "59yh36" -> null
      - path        = "/pipeline_pharmcat/results" -> null
      - path_part   = "results" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "2y46pa0m1f" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.submit will be destroyed
  # (because aws_api_gateway_resource.submit is not in configuration)
  - resource "aws_api_gateway_resource" "submit" {
      - id          = "w1ri0h" -> null
      - parent_id   = "59yh36" -> null
      - path        = "/pipeline_pharmcat/submit" -> null
      - path_part   = "submit" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "2y46pa0m1f" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIGetResultsURL will be destroyed
  # (because aws_lambda_permission.APIGetResultsURL is not in configuration)
  - resource "aws_lambda_permission" "APIGetResultsURL" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - id                  = "AllowAPIGetResultsURLInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:496940679572:2y46pa0m1f/*/*/results" -> null
      - statement_id        = "AllowAPIGetResultsURLInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIInitPharmcat will be destroyed
  # (because aws_lambda_permission.APIInitPharmcat is not in configuration)
  - resource "aws_lambda_permission" "APIInitPharmcat" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-initPharmcat" -> null
      - id                  = "AllowAPIInitPharmcatInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:496940679572:2y46pa0m1f/*/*/submit" -> null
      - statement_id        = "AllowAPIInitPharmcatInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPreprocessor will be destroyed
  # (because aws_lambda_permission.LambdaPreprocessor is not in configuration)
  - resource "aws_lambda_permission" "LambdaPreprocessor" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-preprocessor" -> null
      - id                  = "PGxFlowBackendAllowLambdaPreprocessorInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initPharmcat" -> null
      - statement_id        = "PGxFlowBackendAllowLambdaPreprocessorInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.preprocessor_invoke_permission will be created
  + resource "aws_lambda_permission" "preprocessor_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-preprocessor"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPreprocessorAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic.preprocessor will be created
  + resource "aws_sns_topic" "preprocessor" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pgxflow-backend-preprocessor"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic_subscription.preprocessor will be created
  + resource "aws_sns_topic_subscription" "preprocessor" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-preprocessor"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:3" -> (known after apply)
      ~ code_sha256                 = "zlkihLUd3mCHUsGVUU3iT16sTlYEGcHKIpD9nbl81NI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-15T04:02:22.722+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/be0c466ebe7a82a00e1fe7656f151fef978c5b2fd3e4193de76ae46fd7a2ad3e.zip" -> "builds/46980ef52a78c61def970fce5b630af53e36d76ca8eeefd8355065d2aa753fa3.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172652 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250519061947328000000003/builds/be0c466ebe7a82a00e1fe7656f151fef978c5b2fd3e4193de76ae46fd7a2ad3e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "a8b160bb98c43f6a2db3cc4dafcf5c33" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250519061947328000000003/builds/be0c466ebe7a82a00e1fe7656f151fef978c5b2fd3e4193de76ae46fd7a2ad3e.zip" -> (known after apply)
      ~ key                           = "builds/be0c466ebe7a82a00e1fe7656f151fef978c5b2fd3e4193de76ae46fd7a2ad3e.zip" -> "builds/46980ef52a78c61def970fce5b630af53e36d76ca8eeefd8355065d2aa753fa3.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/be0c466ebe7a82a00e1fe7656f151fef978c5b2fd3e4193de76ae46fd7a2ad3e.zip" -> "builds/46980ef52a78c61def970fce5b630af53e36d76ca8eeefd8355065d2aa753fa3.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/46980ef52a78c61def970fce5b630af53e36d76ca8eeefd8355065d2aa753fa3.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/46980ef52a78c61def970fce5b630af53e36d76ca8eeefd8355065d2aa753fa3.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "453736253924532320" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/be0c466ebe7a82a00e1fe7656f151fef978c5b2fd3e4193de76ae46fd7a2ad3e.zip" -> "builds/46980ef52a78c61def970fce5b630af53e36d76ca8eeefd8355065d2aa753fa3.zip"
          ~ "timestamp" = "1747635795901009000" -> "1754276093831047000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8" -> (known after apply)
      ~ code_sha256                 = "jtZxEfy29bBOx1YThAx4eHWZTJsQgx2j+N1cZuO4TpU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-11T02:57:06.405+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" -> "builds/7a5ce0e5223d8dcb0ba1812dfa7845f736057e447466aafbb9bb47296b258cf2.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 7497 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250519061947328000000003/builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "3625264d57fcdfff36b63570ceefca61" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250519061947328000000003/builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" -> (known after apply)
      ~ key                           = "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" -> "builds/7a5ce0e5223d8dcb0ba1812dfa7845f736057e447466aafbb9bb47296b258cf2.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" -> "builds/7a5ce0e5223d8dcb0ba1812dfa7845f736057e447466aafbb9bb47296b258cf2.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7a5ce0e5223d8dcb0ba1812dfa7845f736057e447466aafbb9bb47296b258cf2.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7a5ce0e5223d8dcb0ba1812dfa7845f736057e447466aafbb9bb47296b258cf2.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6084468297805162039" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/94c6882a481c62953553ff6049ca66774cd05d0a3217867bdbd131ffd7629b25.zip" -> "builds/7a5ce0e5223d8dcb0ba1812dfa7845f736057e447466aafbb9bb47296b258cf2.zip"
          ~ "timestamp" = "1752551955057360800" -> "1754276082571664000"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "sbeacon-submitdataset-lambda-containers"
        name                 = "sbeacon-submitdataset-lambda-containers"
      ~ tags                 = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all             = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "cdf30729b6e82d17b5323b6c18b6e1fe622923f5"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:cec4ddd31c72cc4a8fdb1cbe9e02a470efcaa42bca342cc89f911dfef477c245" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:cec4ddd31c72cc4a8fdb1cbe9e02a470efcaa42bca342cc89f911dfef477c245" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "24004f4bc0e39f3169652d506961a2cf5d7cb20f" -> "cdf30729b6e82d17b5323b6c18b6e1fe622923f5"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-admin"
        name              = "/aws/lambda/sbeacon-backend-admin"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-admin"
        name                  = "sbeacon-backend-admin"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-info",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:496940679572:notebook-instance/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip" -> "builds/60ca44723d816df83a61023ad0f0b7e35ef967041107c0eb4829fa8239648076.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-07-15T04:02:43.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:5",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/60ca44723d816df83a61023ad0f0b7e35ef967041107c0eb4829fa8239648076.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/60ca44723d816df83a61023ad0f0b7e35ef967041107c0eb4829fa8239648076.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1885523845573902370" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip" -> "builds/60ca44723d816df83a61023ad0f0b7e35ef967041107c0eb4829fa8239648076.zip"
          ~ "timestamp" = "1751933412710514000" -> "1754276086573785000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-dataPortal"
        name              = "/aws/lambda/sbeacon-backend-dataPortal"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-dataPortal"
        name                  = "sbeacon-backend-dataPortal"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-info",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:496940679572:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::496940679572:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250519061956402900000002/*",
                          - "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1"
        name        = "sbeacon-backend-dataPortal-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.